---
title: ViewFailures
classe: Autodesk.Revit.DB.BuiltInFailures+ViewFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 20
---

# ViewFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId BadViewDirectionSetting { get; }` | `ViewFailures.BadViewDirectionSetting` | FailureDefinitionId |
| `FailureDefinitionId CanNotDeleteLastOpenView { get; }` | `ViewFailures.CanNotDeleteLastOpenView` | FailureDefinitionId |
| `FailureDefinitionId CannotPasteViewReferences { get; }` | `ViewFailures.CannotPasteViewReferences` | FailureDefinitionId |
| `FailureDefinitionId CannotToggleToPerspective { get; }` | `ViewFailures.CannotToggleToPerspective` | FailureDefinitionId |
| `FailureDefinitionId DetailNumberDuplicate { get; }` | `ViewFailures.DetailNumberDuplicate` | FailureDefinitionId |
| `FailureDefinitionId DetailNumberEmpty { get; }` | `ViewFailures.DetailNumberEmpty` | FailureDefinitionId |
| `FailureDefinitionId InitialViewDeleted { get; }` | `ViewFailures.InitialViewDeleted` | FailureDefinitionId |
| `FailureDefinitionId InsertColumnViewError { get; }` | `ViewFailures.InsertColumnViewError` | FailureDefinitionId |
| `FailureDefinitionId InsertColumnViewFailure { get; }` | `ViewFailures.InsertColumnViewFailure` | FailureDefinitionId |
| `FailureDefinitionId InsertComponentViewError { get; }` | `ViewFailures.InsertComponentViewError` | FailureDefinitionId |
| `FailureDefinitionId InsertComponentViewFailure { get; }` | `ViewFailures.InsertComponentViewFailure` | FailureDefinitionId |
| `FailureDefinitionId InvalidDBviewScopeBox { get; }` | `ViewFailures.InvalidDBviewScopeBox` | FailureDefinitionId |
| `FailureDefinitionId NoTargetsForDependentViewPropagation { get; }` | `ViewFailures.NoTargetsForDependentViewPropagation` | FailureDefinitionId |
| `FailureDefinitionId NothingToApplyError { get; }` | `ViewFailures.NothingToApplyError` | FailureDefinitionId |
| `FailureDefinitionId NothingToApplyWarning { get; }` | `ViewFailures.NothingToApplyWarning` | FailureDefinitionId |
| `FailureDefinitionId ReloadLatestDeletedLastOpenView { get; }` | `ViewFailures.ReloadLatestDeletedLastOpenView` | FailureDefinitionId |
| `FailureDefinitionId TurnCropRegionOffRemovesViewBreaks { get; }` | `ViewFailures.TurnCropRegionOffRemovesViewBreaks` | FailureDefinitionId |
| `FailureDefinitionId ViewPublishFailed { get; }` | `ViewFailures.ViewPublishFailed` | FailureDefinitionId |
| `FailureDefinitionId ZeroLengthViewBreaksRemoved { get; }` | `ViewFailures.ZeroLengthViewBreaksRemoved` | FailureDefinitionId |
| `FailureDefinitionId ZeroLengthViewRegionsRemoved { get; }` | `ViewFailures.ZeroLengthViewRegionsRemoved` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```